# GetUnits Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryPressureDropUIData..::..GetUnits Method
PipeFittingAndAccessoryPressureDropUIData Class See Also
---
Gets units.
**Namespace:** Autodesk.Revit.UI.Plumbing**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Units GetUnits()
```

Visual Basic
---
```text
Public Function GetUnits As Units
```

Visual C++
---
```text
public:
Units^ GetUnits()
```

# ### Return Value
The Units object.
# See Also
PipeFittingAndAccessoryPressureDropUIData Class
Autodesk.Revit.UI.Plumbing Namespace